In [1]:
import numpy as np
import pandas as pd

# pip show pandas

pandas_version = pd.__version__
pandas_version

'2.3.0'

Pandas Series

A Series is a one-dimensional labeled array that can hold any data type.
It automatically creates an index (0, 1, 2...).

In [2]:
array = np.array([1,2,3,4,5])
pandas_series = pd.Series(array)
pandas_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

Pandas DataFrame

A DataFrame is a two-dimensional labeled data structure with rows and columns (like a table or spreadsheet).

In [3]:
# Creating DataFrames from Dictionary
employees = {
    "employee_id": ["EMP0001","EMP0002","EMP0003"],
    "department": ["Executive team", "HR", "IT"],
}
pd_dict_df = pd.DataFrame(employees)
pd_dict_df

  employee_id      department
0     EMP0001  Executive team
1     EMP0002              HR
2     EMP0003              IT

In [4]:
# Creating DataFrames from List
users = [
    ["Brijesh Gondaliya", 28, "23-12-1996"],
    ["Divyesh Mangroliya", 27, "02-08-1997"],
    ["Mushrat Arab", 18, "11-06-2007"]
]

columns_ = ["Fullname", "Age", "Date_Of_Birth"]
pd_list_df = pd.DataFrame(users, columns=columns_)
pd_list_df

             Fullname  Age Date_Of_Birth
0   Brijesh Gondaliya   28    23-12-1996
1  Divyesh Mangroliya   27    02-08-1997
2        Mushrat Arab   18    11-06-2007

Data Loading and Saving:

In [5]:
# Creating DataFrames from CSV File
pd_csv_df = pd.read_csv("data/employee.csv")
# pd_csv_df.to_csv()

   ID     Name   Age  Gender Department   Salary    JoinDate  Rating
0   1    Alice  25.0  Female      Sales  50000.0  2020-01-15     4.5
1   2      Bob  28.0    Male  Marketing  52000.0  2019-03-22     4.0
2   3  Charlie  30.0    Male         HR      NaN  2018-07-30     3.8
3   4    David  24.0    Male      Sales  48000.0  2021-05-19     4.2
4   5      Eva  27.0  Female         IT      NaN  2022-02-11     4.7
5   6    Frank   NaN    Male  Marketing  53000.0  2020-11-03     NaN
6   7    Grace  26.0  Female         IT  56000.0  2021-12-01     4.9
7   8     Hank  31.0    Male         HR  51000.0  2017-08-16     3.6
8   9      Ivy  29.0  Female      Sales  50000.0  2020-09-25     4.1
9  10     John  28.0    Male         IT  57000.0  2019-06-14     4.3

In [6]:
# Creating DataFrames from Excel File
pd_excel_df = pd.read_excel("data/product.xlsx") # # You need openpyxl or xlrd installed
pd_excel_df

   ProductID ProductName     Category  Price  Stock  Rating  LaunchDate
0        101      Laptop  Electronics  75000     50     4.5  2021-05-10
1        102       Mouse  Accessories   1500    200     4.0  2020-11-20
2        103    Keyboard  Accessories   2500    150     3.8  2021-01-15
3        104     Monitor  Electronics  12000     75     4.2  2019-07-30
4        105     Printer  Electronics   8000     30     4.1  2022-02-01
5        106      Webcam  Accessories   3000     60     4.3  2021-08-12
6        107     Speaker  Accessories   2000     90     3.9  2020-03-05
7        108     Headset  Accessories   3500     40     4.0  2022-10-18

.shape :
Gives the number of rows and columns in a DataFrame.

In [7]:
pd_excel_df.shape # (8, 7) # 8 rows, 7 columns

(8, 7)

.columns: Returns the list of column names.
.keys(): Alias of .columns()

In [8]:
# pd_excel_df.columns
pd_excel_df.keys()

Index(['ProductID', 'ProductName', 'Category', 'Price', 'Stock', 'Rating',
       'LaunchDate'],
      dtype='object')

list(df): Column names as list

.dtypes: 
Shows the data type of each column.

In [9]:
list(pd_excel_df)

['ProductID',
 'ProductName',
 'Category',
 'Price',
 'Stock',
 'Rating',
 'LaunchDate']

In [10]:
pd_excel_df.dtypes

ProductID        int64
ProductName     object
Category        object
Price            int64
Stock            int64
Rating         float64
LaunchDate      object
dtype: object

.size: Total elements (rows × columns)

In [11]:
pd_excel_df.size

56

.ndim: Number of dimensions

In [12]:
pd_excel_df.ndim

2

In [13]:
pd_excel_df.keys()

Index(['ProductID', 'ProductName', 'Category', 'Price', 'Stock', 'Rating',
       'LaunchDate'],
      dtype='object')

.axes: List of row and column index

In [14]:
pd_excel_df.axes

[RangeIndex(start=0, stop=8, step=1),
 Index(['ProductID', 'ProductName', 'Category', 'Price', 'Stock', 'Rating',
        'LaunchDate'],
       dtype='object')]

.info(): Summary including dtypes & nulls

In [15]:
pd_csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         9 non-null      float64
 3   Gender      10 non-null     object
 4   Department  10 non-null     object
 5   Salary      8 non-null      float64
 6   JoinDate    10 non-null     object
 7   Rating      9 non-null      float64
dtypes: float64(3), int64(1), object(4)
memory usage: 772.0+ bytes

.select_dtypes() is a DataFrame method used to filter columns based on their data types.

In [16]:
# df.select_dtypes(include=None, exclude=None)
pd_csv_df.select_dtypes(include="object")
pd_csv_df.select_dtypes(exclude="object")
pd_csv_df.select_dtypes(exclude="number")
pd_csv_df.select_dtypes(include="number", exclude="float64")

   ID
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

Indexing & Slicing in Pandas
____________________________
.loc[] → Label-Based Selection

🧠 Think: "I want to select data using names of rows or columns"
.loc[] works on row and column labels (not numbers).

You can select:

A single row/column by label

A range of rows (inclusive)

A subset of rows/columns

Use .loc[] when your DataFrame has meaningful index/column names.

In [17]:
pd_csv_df = pd.read_csv("data/employee.csv")
# pd_csv_df.loc[0] # lect row with index label 0
# pd_csv_df.loc[0, "Name"] # Select a single value
# pd_csv_df.loc[0, ["Name","Age"]] # select only one row with Name and Age 
# ⚠️ .loc[start:end] is inclusive of both start and end
pd_csv_df.loc[:, ["Name","Age"]] # All rows, only 'Name' and 'Age' columns

      Name   Age
0    Alice  25.0
1      Bob  28.0
2  Charlie  30.0
3    David  24.0
4      Eva  27.0
5    Frank   NaN
6    Grace  26.0
7     Hank  31.0
8      Ivy  29.0
9     John  28.0

.iloc[] → Position-Based Selection
🧠 Think: "I want to access data by row and column number"
.iloc[] works like a NumPy array: it uses integer positions

Indexing is zero-based

You can select:

Specific row/column by number

Slices of rows/columns

In [18]:
# pd_csv_df.iloc[0] # First row
# pd_csv_df.iloc[0, 1] # First row, second column
# ⚠️ .iloc[start:end] is exclusive of the end
pd_csv_df.iloc[0:2, 1:3] # First 2 rows, column 2 to 3 (exclusive of end)

    Name   Age
0  Alice  25.0
1    Bob  28.0

.at[] → Fast Scalar Access (Label-Based)
🧠 Think: "I just need one value, and I know the row/column name"

.at[] is like .loc[] but only for single cell

It is faster than .loc[] for scalar lookups

Only allows one row label and one column label

In [19]:
pd_csv_df.at[0, "Name"]
pd_csv_df.at[0, "Age"]
before = pd_csv_df.at[1, "Name"] # Get a single value
print(before)
pd_csv_df.at[1, "Name"] = "Brijesh"
after = pd_csv_df.at[1, "Name"] # Get a single value
print(after)

Bob
Brijesh

| Scenario                                   | Use       |
| ------------------------------------------ | --------- |
| You know row/column **names**              | `.loc[]`  |
| You know **position** (row 0, col 1, etc.) | `.iloc[]` |
| You need **one specific cell (by name)**   | `.at[]`   |
| You want **fast performance on one value** | `.at[]`   |

In [20]:
# Selecting Columns Only
# pd_csv_df.columns
# pd_csv_df['Name'] # Returns a Series
# pd_csv_df.Name  # Also valid (if no space in column name)
pd_csv_df[["Name", "Salary"]] # Returns a DataFrame

      Name   Salary
0    Alice  50000.0
1  Brijesh  52000.0
2  Charlie      NaN
3    David  48000.0
4      Eva      NaN
5    Frank  53000.0
6    Grace  56000.0
7     Hank  51000.0
8      Ivy  50000.0
9     John  57000.0

In [21]:
# Selecting Rows Only
# Using .loc[] with label
pd_csv_df.loc[0] # Row with label 0
pd_csv_df.loc[[0, 3]] # Multiple rows
pd_csv_df.loc[0:3] # # Row slice (inclusive)

# Using .iloc[] with index
pd_csv_df.iloc[0]           # First row
pd_csv_df.iloc[0:2]         # First two rows
pd_csv_df.iloc[[0, 2]]      # Row 0 and 2

   ID     Name   Age  Gender Department   Salary    JoinDate  Rating
0   1    Alice  25.0  Female      Sales  50000.0  2020-01-15     4.5
2   3  Charlie  30.0    Male         HR      NaN  2018-07-30     3.8

In [22]:
# Selecting Rows and Columns
# Label-based: .loc[row_label, column_label]
pd_csv_df.loc[0, 'Name'] # Single value
pd_csv_df.loc[0, ["Name", "Salary"]] # Row 0, columns 'Name' & 'Salary'
pd_csv_df.loc[0:2, ["Name", "Salary"]]
pd_csv_df.loc[[0,2], ["Name", "Age"]]

# Position-based: .iloc[row_index, column_index]
pd_csv_df.iloc[0, 1]            # Row 0, Column 1 → 'Alice'
pd_csv_df.iloc[[0, 2], [0, 2]]  # Rows 0 & 2, Columns 0 & 2

   ID   Age
0   1  25.0
2   3  30.0

In [23]:
# Select Based on Conditions (Boolean Filtering)
pd_csv_df[pd_csv_df["Age"] > 25]
pd_csv_df[(pd_csv_df["Age"] > 25) & (pd_csv_df["Salary"] <= 50000)]
pd_csv_df[(pd_csv_df["Age"] > 25) | (pd_csv_df["Salary"] >= 50000)]
pd_csv_df[(pd_csv_df["Age"] > 25) & (pd_csv_df["Salary"] >= 50000)]

   ID     Name   Age  Gender Department   Salary    JoinDate  Rating
1   2  Brijesh  28.0    Male  Marketing  52000.0  2019-03-22     4.0
6   7    Grace  26.0  Female         IT  56000.0  2021-12-01     4.9
7   8     Hank  31.0    Male         HR  51000.0  2017-08-16     3.6
8   9      Ivy  29.0  Female      Sales  50000.0  2020-09-25     4.1
9  10     John  28.0    Male         IT  57000.0  2019-06-14     4.3

In [24]:
# Pandas functions:
# head() – View Top Rows
pd_csv_df.head(5)
# tail() – View Bottom Rows
pd_csv_df.tail(5)
# isin() – Filter Specific Departments
pd_csv_df.isin(["IT", "HR"])
pd_csv_df[pd_csv_df["Department"].isin(["IT", "HR"])]
# notna() – Check for Non-Null Salary
pd_csv_df[pd_csv_df['Salary'].notna()]
# isna() – Check for Missing Rating
pd_csv_df[pd_csv_df["Rating"].isna()]

   ID   Name  Age Gender Department   Salary    JoinDate  Rating
5   6  Frank  NaN   Male  Marketing  53000.0  2020-11-03     NaN